{
    "class_name": "Model",
    "config": {
        "name": "vgg16",
        "layers": [
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(720)",
                    "weight": "(720, 256, 3, 3)",
                    "layer_id": "140337405022728"
                },
                "name": "bbox_head.retina_cls",
                "inbound_nodes": [
                    [
                        [
                            "140336448255928/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "140336448255928/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bbox_head.cls_convs.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "140337405022504"
                },
                "name": "bbox_head.cls_convs.3",
                "inbound_nodes": [
                    [
                        [
                            "140336448257160/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "140336448257160/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bbox_head.cls_convs.2"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "140337405022280"
                },
                "name": "bbox_head.cls_convs.2",
                "inbound_nodes": [
                    [
                        [
                            "140336448257552/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "140336448257552/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bbox_head.cls_convs.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "140337417830184"
                },
                "name": "bbox_head.cls_convs.1",
                "inbound_nodes": [
                    [
                        [
                            "140336448257944/Relu1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Relu1",
                "config": "None",
                "name": "140336448257944/Relu1",
                "inbound_nodes": [
                    [
                        [
                            "bbox_head.cls_convs.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "140337417829960"
                },
                "name": "bbox_head.cls_convs.0",
                "inbound_nodes": [
                    [
                        [
                            "neck.fpn_convs.0.conv"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 256, 3, 3)",
                    "layer_id": "140337417828280"
                },
                "name": "neck.fpn_convs.0.conv",
                "inbound_nodes": [
                    [
                        [
                            "140336448381560/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "140336448381560/Add0",
                "inbound_nodes": [
                    [
                        [
                            "neck.lateral_convs.0.conv"
                        ],
                        [
                            "140336448381896/UpsampleNearest2D"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 32, 1, 1)",
                    "layer_id": "140337417828168"
                },
                "name": "neck.lateral_convs.0.conv",
                "inbound_nodes": [
                    [
                        [
                            "140336448382008/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "140336448382008/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.7"
                        ],
                        [
                            "140336448382344/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "140337417986344"
                },
                "name": "backbone.blocks.3.layers.2.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(32, 192, 1, 1)",
                    "layer_id": "140337417986288"
                },
                "name": "backbone.blocks.3.layers.2.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140336448382680/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448382680/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(192)",
                    "weight": "(192)",
                    "layer_id": "140337417986176"
                },
                "name": "backbone.blocks.3.layers.2.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(192, 1, 3, 3)",
                    "layer_id": "140337417986120"
                },
                "name": "backbone.blocks.3.layers.2.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140336448383240/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448383240/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(192)",
                    "weight": "(192)",
                    "layer_id": "140337418362776"
                },
                "name": "backbone.blocks.3.layers.2.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.2.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(192, 32, 1, 1)",
                    "layer_id": "140337418362720"
                },
                "name": "backbone.blocks.3.layers.2.op.0",
                "inbound_nodes": [
                    [
                        [
                            "140336448382344/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "140336448382344/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.7"
                        ],
                        [
                            "backbone.blocks.3.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "140337418362104"
                },
                "name": "backbone.blocks.3.layers.1.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(32, 192, 1, 1)",
                    "layer_id": "140337418362048"
                },
                "name": "backbone.blocks.3.layers.1.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140336448384360/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448384360/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(192)",
                    "weight": "(192)",
                    "layer_id": "140337418361936"
                },
                "name": "backbone.blocks.3.layers.1.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(192, 1, 3, 3)",
                    "layer_id": "140337418361880"
                },
                "name": "backbone.blocks.3.layers.1.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140336448384920/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448384920/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(192)",
                    "weight": "(192)",
                    "layer_id": "140337418361768"
                },
                "name": "backbone.blocks.3.layers.1.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.1.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(192, 32, 1, 1)",
                    "layer_id": "140337418361712"
                },
                "name": "backbone.blocks.3.layers.1.op.0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "140337418361096"
                },
                "name": "backbone.blocks.3.layers.0.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(32, 144, 1, 1)",
                    "layer_id": "140337418361040"
                },
                "name": "backbone.blocks.3.layers.0.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140336448369496/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448369496/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(144)",
                    "weight": "(144)",
                    "layer_id": "140337418360928"
                },
                "name": "backbone.blocks.3.layers.0.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(144, 1, 7, 7)",
                    "layer_id": "140337418360872"
                },
                "name": "backbone.blocks.3.layers.0.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140336448370056/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448370056/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(144)",
                    "weight": "(144)",
                    "layer_id": "140337418360760"
                },
                "name": "backbone.blocks.3.layers.0.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.3.layers.0.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(144, 24, 1, 1)",
                    "layer_id": "140337418360704"
                },
                "name": "backbone.blocks.3.layers.0.op.0",
                "inbound_nodes": [
                    [
                        [
                            "140336448370616/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "140336448370616/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.7"
                        ],
                        [
                            "backbone.blocks.2.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(24)",
                    "weight": "(24)",
                    "layer_id": "140337418359584"
                },
                "name": "backbone.blocks.2.layers.1.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(24, 72, 1, 1)",
                    "layer_id": "140337418359528"
                },
                "name": "backbone.blocks.2.layers.1.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140336448371232/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448371232/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(72)",
                    "weight": "(72)",
                    "layer_id": "140337418359416"
                },
                "name": "backbone.blocks.2.layers.1.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(72, 1, 3, 3)",
                    "layer_id": "140337418359360"
                },
                "name": "backbone.blocks.2.layers.1.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140336448371792/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448371792/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(72)",
                    "weight": "(72)",
                    "layer_id": "140337418359248"
                },
                "name": "backbone.blocks.2.layers.1.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.1.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(72, 24, 1, 1)",
                    "layer_id": "140337418359192"
                },
                "name": "backbone.blocks.2.layers.1.op.0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(24)",
                    "weight": "(24)",
                    "layer_id": "140337418208816"
                },
                "name": "backbone.blocks.2.layers.0.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(24, 96, 1, 1)",
                    "layer_id": "140337418208872"
                },
                "name": "backbone.blocks.2.layers.0.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140336448372688/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448372688/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(96)",
                    "weight": "(96)",
                    "layer_id": "140337418209544"
                },
                "name": "backbone.blocks.2.layers.0.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(96, 1, 5, 5)",
                    "layer_id": "140337418209656"
                },
                "name": "backbone.blocks.2.layers.0.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140336448352832/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448352832/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(96)",
                    "weight": "(96)",
                    "layer_id": "140337418210944"
                },
                "name": "backbone.blocks.2.layers.0.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.2.layers.0.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(96, 16, 1, 1)",
                    "layer_id": "140337418211280"
                },
                "name": "backbone.blocks.2.layers.0.op.0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.1.layers.0.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(16)",
                    "weight": "(16)",
                    "layer_id": "140337418210608"
                },
                "name": "backbone.blocks.1.layers.0.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.1.layers.0.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(16, 32, 1, 1)",
                    "layer_id": "140337418210552"
                },
                "name": "backbone.blocks.1.layers.0.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140336448353784/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448353784/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.1.layers.0.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "140337418210440"
                },
                "name": "backbone.blocks.1.layers.0.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.1.layers.0.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(32, 1, 3, 3)",
                    "layer_id": "140337418210384"
                },
                "name": "backbone.blocks.1.layers.0.op.0",
                "inbound_nodes": [
                    [
                        [
                            "140336448354344/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448354344/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.0.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(32)",
                    "weight": "(32)",
                    "layer_id": "140337770370160"
                },
                "name": "backbone.blocks.0.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.0.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(32, 3, 3, 3)",
                    "layer_id": "140337418209152"
                },
                "name": "backbone.blocks.0.0",
                "inbound_nodes": []
            },
            {
                "class_name": "UpsampleNearest2D",
                "config": "None",
                "name": "140336448381896/UpsampleNearest2D",
                "inbound_nodes": [
                    [
                        [
                            "140336448382176/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "140336448382176/Add0",
                "inbound_nodes": [
                    [
                        [
                            "neck.lateral_convs.1.conv"
                        ],
                        [
                            "140336448384584/UpsampleNearest2D"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "bias": "(256)",
                    "weight": "(256, 96, 1, 1)",
                    "layer_id": "140337417828504"
                },
                "name": "neck.lateral_convs.1.conv",
                "inbound_nodes": [
                    [
                        [
                            "140336448368824/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "140336448368824/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.7"
                        ],
                        [
                            "backbone.blocks.5.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(96)",
                    "weight": "(96)",
                    "layer_id": "140337418103888"
                },
                "name": "backbone.blocks.5.layers.1.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(96, 288, 1, 1)",
                    "layer_id": "140337418103832"
                },
                "name": "backbone.blocks.5.layers.1.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140336448355184/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448355184/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(288)",
                    "weight": "(288)",
                    "layer_id": "140337418103720"
                },
                "name": "backbone.blocks.5.layers.1.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(288, 1, 5, 5)",
                    "layer_id": "140337418103664"
                },
                "name": "backbone.blocks.5.layers.1.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140336448355688/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140336448355688/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(288)",
                    "weight": "(288)",
                    "layer_id": "140337418103552"
                },
                "name": "backbone.blocks.5.layers.1.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.1.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(288, 96, 1, 1)",
                    "layer_id": "140337418103496"
                },
                "name": "backbone.blocks.5.layers.1.op.0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(96)",
                    "weight": "(96)",
                    "layer_id": "140337418102880"
                },
                "name": "backbone.blocks.5.layers.0.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(96, 384, 1, 1)",
                    "layer_id": "140337418102824"
                },
                "name": "backbone.blocks.5.layers.0.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140337405935856/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140337405935856/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "140337418102712"
                },
                "name": "backbone.blocks.5.layers.0.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(384, 1, 5, 5)",
                    "layer_id": "140337418102656"
                },
                "name": "backbone.blocks.5.layers.0.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140337405936360/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140337405936360/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "140337418102544"
                },
                "name": "backbone.blocks.5.layers.0.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.5.layers.0.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(384, 64, 1, 1)",
                    "layer_id": "140337418102488"
                },
                "name": "backbone.blocks.5.layers.0.op.0",
                "inbound_nodes": [
                    [
                        [
                            "140337405936864/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "140337405936864/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.7"
                        ],
                        [
                            "140337405937144/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "140337418101480"
                },
                "name": "backbone.blocks.4.layers.3.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 384, 1, 1)",
                    "layer_id": "140337418101424"
                },
                "name": "backbone.blocks.4.layers.3.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140337405937480/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140337405937480/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "140337418101312"
                },
                "name": "backbone.blocks.4.layers.3.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(384, 1, 3, 3)",
                    "layer_id": "140337418101256"
                },
                "name": "backbone.blocks.4.layers.3.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140337405937984/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140337405937984/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "140337418101144"
                },
                "name": "backbone.blocks.4.layers.3.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.3.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(384, 64, 1, 1)",
                    "layer_id": "140337418101088"
                },
                "name": "backbone.blocks.4.layers.3.op.0",
                "inbound_nodes": [
                    [
                        [
                            "140337405937144/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "140337405937144/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.7"
                        ],
                        [
                            "140337405938712/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "140337417989816"
                },
                "name": "backbone.blocks.4.layers.2.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 384, 1, 1)",
                    "layer_id": "140337417989760"
                },
                "name": "backbone.blocks.4.layers.2.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140337405939048/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140337405939048/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "140337417989648"
                },
                "name": "backbone.blocks.4.layers.2.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(384, 1, 5, 5)",
                    "layer_id": "140337417989592"
                },
                "name": "backbone.blocks.4.layers.2.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140337405939552/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140337405939552/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "140337417989480"
                },
                "name": "backbone.blocks.4.layers.2.op.1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.2.op.0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(384, 64, 1, 1)",
                    "layer_id": "140337417989424"
                },
                "name": "backbone.blocks.4.layers.2.op.0",
                "inbound_nodes": [
                    [
                        [
                            "140337405938712/Add0"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add0",
                "config": "None",
                "name": "140337405938712/Add0",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.1.op.7"
                        ],
                        [
                            "backbone.blocks.4.layers.0.op.7"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(64)",
                    "weight": "(64)",
                    "layer_id": "140337417988808"
                },
                "name": "backbone.blocks.4.layers.1.op.7",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.1.op.6"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Convolution2D",
                "config": {
                    "weight": "(64, 384, 1, 1)",
                    "layer_id": "140337417988752"
                },
                "name": "backbone.blocks.4.layers.1.op.6",
                "inbound_nodes": [
                    [
                        [
                            "140337405961160/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
                "class_name": "Hardtanh1",
                "config": "None",
                "name": "140337405961160/Hardtanh1",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.1.op.4"
                        ]
                    ]
                ]
            },
            {
                "class_name": "CudnnBatchNorm",
                "config": {
                    "bias": "(384)",
                    "weight": "(384)",
                    "layer_id": "140337417988640"
                },
                "name": "backbone.blocks.4.layers.1.op.4",
                "inbound_nodes": [
                    [
                        [
                            "backbone.blocks.4.layers.1.op.3"
                        ]
                    ]
                ]
            },
            {
                "class_name": "ThnnConvDepthwise2D",
                "config": {
                    "weight": "(384, 1, 7, 7)",
                    "layer_id": "140337417988584"
                },
                "name": "backbone.blocks.4.layers.1.op.3",
                "inbound_nodes": [
                    [
                        [
                            "140337405961664/Hardtanh1"
                        ]
                    ]
                ]
            },
            {
